import HorizontalInfoCard, {
  type HorizontalInfoCardObject,
} from "@/src/components/HorizontalInfoCard";

type AlternativeEnergyInfoCard = HorizontalInfoCardObject & {
  id: number;
};

type NetworksContractService = {
  id: number;
  text: string;
};

const networksContractServices: NetworksContractService[] = [
  {
    id: 1,
    text: "Електромонтажні роботи",
  },
  {
    id: 2,
    text: "Монтаж і встановлення збірних конструкцій",
  },
  {
    id: 3,
    text: "Монтаж металевих конструкцій",
  },
  {
    id: 4,
    text: "Спеціалізовані будівельні роботи",
  },
  {
    id: 5,
    text: "Монтаж високовольтного обладнання та його налагодження",
  },
];

const alternativeEnergyInfoCards: AlternativeEnergyInfoCard[] = [
  {
    id: 1,
    imageUrl: "/data_images/divisions/networks/pl_110kv_starokozache_kanal.jpg",
    imageAlt: "Вітрові електростанції у полі",
    title: "Повітряні лінії електропередач",
    description: "",
    items: [
      "Проектування об’єктів в класах напруги 110-750 кВ",
      "Землевпорядні роботи",
      "Облаштування тимчасових під’їзних доріг",
      "Монтаж будь-яких типів опор",
      "Монтаж залізобетонних, монолітних, пальових типів фундаментів",
      "Монтаж фазних проводів",
      "Монтаж волоконно-оптичних кабелів",
      "Проведення випробувань і пуско-налагоджувальні роботи",
      "Контроль і технічне обслуговування",
      "Аварійно-відновлювальні роботи",
      "Досвід будівництва об’єктів до 750 кВ",
    ],
  },
  {
    id: 2,
    imageUrl: "/data_images/divisions/networks/kabelna_liniya.jpg",
    imageAlt: "Сонячна електростанція",
    title: "Кабельні лінії електропередач",
    description: "",
    items: [
      "Проектування, постачання, будівництво",
      "Облаштування тимчасових під’їзних доріг",
      "Комплекс земляних робіт",
      "Монтаж силових кабелів",
      "Монтаж сигнальних і волоконно-оптичних кабелів",
      "Проведення випробувань і пуско-налагоджувальні роботи",
      "Контроль і технічне обслуговування",
      "Аварійно-відновлювальні роботи",
      "Досвід будівництва об’єктів до 220 кВ",
    ],
  },
  {
    id: 3,
    imageUrl: "/data_images/divisions/networks/lito_spetsializovani_roboti.jpg",
    imageAlt: "Монтаж вітрової електростанції",
    title: "Електричні підстанції",
    description: "",
    items: [
      "Проектування",
      "Постачання матеріалів і устаткування",
      "Роботи з підготовки будівельного майданчика",
      "Монтаж фундаментів і будівельні роботи",
      "Монтаж обладнання",
      "Реконструкція та модернізація підстанції",
      "Інспекційні послуги",
      "Проведення випробувань і пуско-налагоджувальні роботи",
      "Релейний захист",
      "Досвід будівництва об’єктів до 750 кВ",
    ],
  },
];

const AlternativeEnergy = () => (
  <section>
    <div className="page-container flex flex-col gap-10">
      {alternativeEnergyInfoCards.map((card: AlternativeEnergyInfoCard) => (
        <HorizontalInfoCard
          key={card.id}
          imageUrl={card.imageUrl}
          imageAlt={card.imageAlt}
          title={card.title}
          description={card.description}
          items={card.items}
        />
      ))}

      <article className="flex flex-col gap-5 text-accent">
        <h2 className="text-center mb-4 text-[clamp(1.5rem,2vw,1.75rem)] leading-snug font-semibold">
          EPCM / EPC контракти
        </h2>

        <p>
          Ми працюємо по двох основних форматах міжнародних стандартів з
          управління проектами в будівництві – EPCM або EPC договорів. Такі
          способи управління масштабно запроваджуються в українську економіку.
          Бізнес-дивізіон «Мережі» бере на себе зобов&apos;язання виконати
          проект від проектування до завершення будівництва &quot;під
          ключ&quot;: будівельно-монтажні роботи, пусконалагоджувальні роботи,
          сервісне обслуговування, виконання функцій генерального підрядника в
          будівництві, комплексне проектування, виконання функцій генерального
          проектувальника, комплектне постачання обладнання.
        </p>

        <p>
          <strong className="font-semibold">ТОВ «Союзенергомонтаж»</strong> -
          дочірнє підприємство Корпорації «СОЮЗ». Засновано у 2008 році.
          Професійний колектив 87 висококваліфікованих фахівців, які мають
          допуски для виконання робіт підвищеної небезпеки на енергетичних
          об&apos;єктах високого класу напруги. Підприємство має ліцензію на
          право здійснення будівельної діяльності та дозволи на виконання робіт
          підвищеної небезпеки та експлуатацію (застосування машин). Наявність
          власної виробничо-складської бази (с. Усатове, Одеської області),
          розташованої на площі земельної ділянки 1,5 га та
          матеріально-технічної бази (63 одиниці спецтехніки та спецмеханізмів)
          дозволяють ТОВ «Союзенергомонтаж» якісно виконувати роботи різної
          складності на високому рівні. Здійснює комплекс послуг:
        </p>

        <ul className="list-disc space-y-2 pl-5  marker:text-accent">
          {networksContractServices.map((service: NetworksContractService) => (
            <li key={service.id}>{service.text}</li>
          ))}
        </ul>
      </article>
    </div>
  </section>
);

export default AlternativeEnergy;
