import Image from "next/image";

const ReachingWin = () => {
  return (
    <section className="page-container">
      <article className="text-accent">
        <p>
          Нам вдалося зберегти колектив, виплачується заробітна плата, своєчасно
          сплачуються в повному обсязі податки до бюджету. Ми усвідомлюємо, що
          сила України є в єдності, в здобутті Перемоги над навалою московитів,
          та робимо все можливе, щоб мир та Перемога запанували в рідній
          Україні.
        </p>
        <h2 className="text-[clamp(1.5rem,3vw,2.2rem)] font-semibold mt-4">
          Наші кроки до Перемоги:
        </h2>
        <p>
          на потреби ЗСУ передано 3 службові автомобілі підприємства (1 пікап та
          2 вантажівки); для забезпечення боєздатності Збройних Сил України та
          надання медичної допомоги українським бійцям Корпорацією «Союз» та
          безпосередньо працівниками компанії надається фінансова підтримка
          (донатимо від душі, підтримуючи наших Героїв); наші колеги, а саме 14
          працівників Корпорації «Союз», вступили до лав ЗСУ та героїчно
          боронять Україну. Для нас було честю працювати з Богданом
          Місяновським, майстер-сержантом ЗСУ та менеджером з охорони нашої
          компанії, який загинув у 2024 році, захищаючи нашу рідну землю.{" "}
        </p>
        <h3 className="text-[clamp(1.5rem,3vw,1.8rem)] font-semibold mt-10 flex m-auto justify-center">
          Пам’ять про Богдана буде жити вічно в наших серцях!
        </h3>
        <Image src="/data_images/memorial.png" alt="Вшанування пам'яті Місяновського Богдана" width={1024} height={1536} className="w-150 flex m-auto justify-center rounded-md mt-3"></Image>
      </article>
    </section>
  );
};

export default ReachingWin;
